data_generation/simulation_results/openfoam/case_70/constant/simParams
nIter 2000;
hComponent0 1078.616227479984;
hComponent1 667.1993918614669;
hComponent2 885.5246545510303;
hComponent3 1415.472373142375;
hComponent4 1430.0759822823309;kComponent0 20.87189765745026;
kComponent1 77.07915586317819;
kComponent2 39.71032643469193;
kComponent3 82.93322909910378;
kComponent4 32.615029128000714;
tAmbient 300;
Ux 1.6941320242778095;
kPCB 0.7402552166965247;